In [2]:
import pandas as pd
import mysql.connector

In [4]:
connection = mysql.connector.connect(host="localhost",user = "root", password = "root",database="exl")
connection

Q1. Write a query to find all departments that have more than 3 employees and a total salary greater than 100,000

In [5]:
query = """
SELECT 
    d.DEPARTMENT_ID,
    d.DEPARTMENT_NAME,
    COUNT(e.EMPLOYEE_ID) AS employee_count,
    SUM(e.SALARY) AS total_salary
FROM 
    departments d
JOIN 
    employees e
ON 
    d.DEPARTMENT_ID = e.DEPARTMENT_ID
GROUP BY 
    d.DEPARTMENT_ID, d.DEPARTMENT_NAME
HAVING 
    COUNT(e.EMPLOYEE_ID) > 3
    AND SUM(e.SALARY) > 100000;
"""
data = pd.read_sql(query,connection)
print(data)

   DEPARTMENT_ID DEPARTMENT_NAME  employee_count  total_salary
0             50        Shipping              33      121700.0
1             80           Sales              47      324200.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\974233347.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

Q2. Retrieve the details of employees whose FIRST_NAME starts with the letter "J" and ends with "n", and their salary is greater than 5000

In [7]:
query = """
SELECT * 
FROM employees 
WHERE first_name LIKE "j%n" 
AND salary > 5000;
"""
data = pd.read_sql(query,connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\2130034300.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,110,John,Chen,JCHEN,515.124.4269,2005-09-28,FI_ACCOUNT,8200.0,NaN,108,100
1,145,John,Russell,JRUSSEL,011.44.1344.429268,2004-10-01,SA_REP,14000.0,0.4,100,80
2,176,Jonathon,Taylor,JTAYLOR,011.44.1343.929288,2006-06-24,SA_REP,8600.0,0.2,100,80

Q3. Find the average salary of employees who were hired before 2015-01-01. Exclude employees with a commission percentage (COMMISSION_PCT) greater than 0.20.

In [9]:
query = """
SELECT AVG(SALARY) AS avg_salary
FROM employees
WHERE HIRE_DATE < '2015-01-01'
AND (COMMISSION_PCT <= 0.20 OR COMMISSION_PCT IS NULL);
"""
data = pd.read_sql(query,connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\2465034685.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

    avg_salary
0  5666.758621

Q4. List the cities from the locations table where the city name: Contains the letter "a" exactly twice.
Ends with the letter "n".

In [11]:
query = """
SELECT CITY
FROM locations
WHERE CITY LIKE '%a%a%n';
"""
data = pd.read_sql(query,connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\1516950322.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

Empty DataFrame
Columns: [CITY]
Index: []

Q5. Find countries (COUNTRY_NAME) that have more than 2 locations and whose REGION_ID is less than 5.

In [12]:
query = """
SELECT c.COUNTRY_NAME, COUNT(l.LOCATION_ID) AS location_count
FROM countries c
JOIN locations l ON c.COUNTRY_ID = l.COUNTRY_ID
GROUP BY c.COUNTRY_NAME
HAVING COUNT(l.LOCATION_ID) > 2
   AND MIN(c.REGION_ID) < 5;
"""
data = pd.read_sql(query,connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\4219381470.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

               COUNTRY_NAME  location_count
0  United States of America               4
1            United Kingdom               3

Q6.The department's LOCATION_ID is in city names starting with "S". The total salary of all employees in the department is less than 200,000.

In [13]:
query = """
SELECT d.DEPARTMENT_ID, d.DEPARTMENT_NAME, SUM(e.SALARY) AS total_salary
FROM departments d
JOIN employees e 
ON d.DEPARTMENT_ID = e.DEPARTMENT_ID
JOIN locations l 
ON d.LOCATION_ID = l.LOCATION_ID
WHERE l.CITY LIKE 'S%'
GROUP BY d.DEPARTMENT_ID, d.DEPARTMENT_NAME
HAVING SUM(e.SALARY) < 200000;
"""
data = pd.read_sql(query,connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\3617715853.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

   DEPARTMENT_ID DEPARTMENT_NAME  total_salary
0             60              IT       28800.0
1             50        Shipping      121700.0
2            110      Accounting       20300.0
3             10  Administration        4400.0
4             30      Purchasing       24900.0
5            100         Finance       51608.0
6             90       Executive       58000.0

Q7. Retrieve a list of all employees whose: LAST_NAME is exactly "Smith".SALARY is higher than the average salary of employees in their department.

In [14]:
query = """
SELECT e.EMPLOYEE_ID, e.FIRST_NAME, e.LAST_NAME, e.SALARY
FROM employees e
JOIN (SELECT DEPARTMENT_ID, AVG(SALARY) AS avg_salary FROM employees GROUP BY DEPARTMENT_ID) 
avg_dept ON e.DEPARTMENT_ID = avg_dept.DEPARTMENT_ID
WHERE e.LAST_NAME = 'Smith' AND e.SALARY > avg_dept.avg_salary;

"""
data = pd.read_sql(query,connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\2877935151.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query,connection)

   EMPLOYEE_ID FIRST_NAME LAST_NAME  SALARY
0          159    Lindsey     Smith  8000.0
1          171    William     Smith  7400.0

Q8. Manage more than 5 employees.Have an average employee salary in their department of less than 50,000.

In [15]:
query = """
SELECT EMPLOYEE_ID, FIRST_NAME, LAST_NAME, SALARY
FROM employees
WHERE MANAGER_ID IS NULL
  AND SALARY > (SELECT AVG(SALARY) FROM employees);

"""
data =pd.read_sql(query, connection)
data

C:\Users\DELL\AppData\Local\Temp\ipykernel_13316\2046025427.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data =pd.read_sql(query, connection)

   EMPLOYEE_ID FIRST_NAME LAST_NAME   SALARY
0          100     Steven      King  24000.0

# Loops for and while

In [18]:
# Q1. Write a while loop that prints the numbers from 1 to 10.

i = 1
while i <= 10:
    print(i)
    i += 1

1
2
3
4
5
6
7
8
9
10

In [19]:
# Q2. Write a while loop that calculates the sum of numbers from 1 to 100.

i = 1
total_sum = 0
while i <= 100:
    total_sum += i
    i += 1
print("The sum is:", total_sum)

The sum is: 5050

In [26]:
# Q3. Write a for loop that prints the squares of numbers from 1 to 5.
for i in range(1,6):
    r = i**2
    print(r)

1
4
9
16
25

In [27]:
# Q4. Write a nested for loop that prints a 3x3 matrix (a list of lists).
for i in range(3):
    for j in range(3):
        print(f'({i}, {j})', end=" ")
    print()

(0, 0) (0, 1) (0, 2)
(1, 0) (1, 1) (1, 2)
(2, 0) (2, 1) (2, 2)

In [28]:
# Q5. Write a for loop that iterates over a list of names and prints each name in uppercase.
names = ['Alice', 'Bob', 'Charlie']
for name in names:
    print(name.upper())

ALICE
BOB
CHARLIE